## 1. SQLite

* SQLite is a C library that provides a lightweight disk-based database that doesn’t require a separate server process and allows accessing the database using a nonstandard variant of the SQL query language. 
* Some applications can use SQLite for internal data storage. It’s also possible to prototype an application using SQLite and then port the code to a larger database such as PostgreSQL or Oracle.

* The sqlite3 module was written by Gerhard Häring. It provides a SQL interface compliant with the DB-API 2.0 specification described by PEP 249.

>**Note:** To use the module, you must first create a Connection object that represents the database. 

**Here, we include some basic function of SQLite;**

- **SQLite and Python types**
- **Connection Establishment with Database**
- **Table Creation and Data Insertion**
- **Some Data Filtering Operation**
- **Table Drop**

### 1.1 SQLite and Python types

SQLite natively supports the following types: **`NULL`**, **`INTEGER`**, **`REAL`**, **`TEXT`**, **`BLOB`**.

The following Python types can thus be sent to `SQLite` without any problem:

|Python type|SQLite type|
|:-|:-|
|None|NULL|
|int|INTEGER|
|float|REAL|
|str|TEXT|
|bytes|BLOB|

This is how SQLite types are converted to Python types by default:

|SQLite type|Python type|
|:-|:-|
|NULL|None|
|INTEGER|int|
|REAL|float|
|TEXT|depends on text_factory, str by default|
|BLOB|bytes|

### 1.2 Connection Establishment with Database 
Here the data will be stored in the `my_database1.db` file:

In [1]:
# importing sqlite
import sqlite3
#connecting with the database.
db = sqlite3.connect("my_database1.db")

>**Note:** You can also supply the special name `:memory:` to create a database in RAM.

### 1.3 Table Creation and Data Insertion
* Once you have a Connection, you can create a Cursor object and call its `execute()` method to perform SQL commands:

In [2]:
c = db.cursor()

In [3]:
# Create table
c.execute('CREATE TABLE company1(ID int, Name text, Age int, Address text, Salary real)')

In [4]:
# Insert a row of data only by providing values
c.execute("INSERT INTO company1 VALUES (1, 'Ram', 32, 'Pune', 50000.00)")
c.execute("INSERT INTO company1 VALUES (2, 'Shyam', 30, 'Mumbai', 70000.00)")

In [5]:
data=c.execute("SELECT * FROM company1")

>**Note:** Its create a sqlite cursor and to get the data you need to iterate over for loop

In [6]:
# Printing selected data
for i in data:
    print(i)

(1, 'Ram', 32, 'Pune', 50000.0)
(2, 'Shyam', 30, 'Mumbai', 70000.0)

In [7]:
for i in c.execute("select * from company1"):
    print(i)

(1, 'Ram', 32, 'Pune', 50000.0)
(2, 'Shyam', 30, 'Mumbai', 70000.0)

In [8]:
list(c.execute("SELECT * FROM company1"))

[(1, 'Ram', 32, 'Pune', 50000.0), (2, 'Shyam', 30, 'Mumbai', 70000.0)]

* There is another way to insert in table by both key and values

In [9]:
# Insert a row of data
c.execute("INSERT INTO company1 (ID, Name, Age, Address, Salary) VALUES (3, 'Vikrant', 42, 'Chennai', 40000.00)")

c.execute("INSERT INTO company1 (ID, Name, Age, Address, Salary) VALUES (4, 'Raju', 31, 'Madurai', 40000.00)")

c.execute("INSERT INTO company1 (ID, Name, Age, Address, Salary) VALUES (5, 'Ankit', 25, 'Pune', 80000.00)")

c.execute("INSERT INTO company1 (ID, Name, Age, Address, Salary) VALUES (6, 'Ravi', 25, 'Pune', 80000.00)")

c.execute("INSERT INTO company1 (ID, Name, Age, Address, Salary) VALUES (7, 'Shivam', 25, 'Bangalore', 80000.00)")

In [10]:
data=c.execute("SELECT * FROM company1")
for i in data:
    print(i)

(1, 'Ram', 32, 'Pune', 50000.0)
(2, 'Shyam', 30, 'Mumbai', 70000.0)
(3, 'Vikrant', 42, 'Chennai', 40000.0)
(4, 'Raju', 31, 'Madurai', 40000.0)
(5, 'Ankit', 25, 'Pune', 80000.0)
(6, 'Ravi', 25, 'Pune', 80000.0)
(7, 'Shivam', 25, 'Bangalore', 80000.0)

In [11]:
# Save (commit) the changes
db.commit()

In [12]:
# We can also close the connection if we are done with it.
# Just be sure any changes have been committed or they will be lost.
db.close()

### 1.4 Some Data Filtering Operation

In [13]:
## Connecting to a Database
db = sqlite3.connect("my_database1.db")
c=db.cursor()

In [14]:
# Showing data for salary greater than 100000
data=c.execute("select * from company1 where Salary >70000")
for x in data:
    print(x)

(5, 'Ankit', 25, 'Pune', 80000.0)
(6, 'Ravi', 25, 'Pune', 80000.0)
(7, 'Shivam', 25, 'Bangalore', 80000.0)

In [15]:
# Showing data for age equal to 25
for x in c.execute("select * from company1 where Age == 25"):
    print(x)

(5, 'Ankit', 25, 'Pune', 80000.0)
(6, 'Ravi', 25, 'Pune', 80000.0)
(7, 'Shivam', 25, 'Bangalore', 80000.0)

In [16]:
# Showing name from data where place is Bangalore
data=c.execute("select Name from company1 where Address = 'Pune'")
for x in data:
    print(x)

('Ram',)
('Ankit',)
('Ravi',)

In [17]:
# Showing ID and Name from data as per accending order of Age
data=c.execute("select ID, Name from company1 order by Age")
list(data)

[(5, 'Ankit'),
 (6, 'Ravi'),
 (7, 'Shivam'),
 (2, 'Shyam'),
 (4, 'Raju'),
 (1, 'Ram'),
 (3, 'Vikrant')]

In [18]:
# Showing ID, Name and Age from data as per deccending order of Age
data=c.execute("select ID, Name, Age from company1 order by Age desc")
for x in data:
    print(x)

(3, 'Vikrant', 42)
(1, 'Ram', 32)
(4, 'Raju', 31)
(2, 'Shyam', 30)
(5, 'Ankit', 25)
(6, 'Ravi', 25)
(7, 'Shivam', 25)

In [19]:
db.commit()
db.close()

### 1.5 Table Drop

In [20]:
# importing sqlite
import sqlite3

#connecting with the database.
db = sqlite3.connect("my_database1.db")
c = db.cursor()

# Create table to store food name and their colories
c.execute('CREATE TABLE food(Name text, Calories int)') 

# Insert a row of data
c.execute("INSERT INTO food VALUES ('Mango', 60)")
c.execute("INSERT INTO food VALUES ('Samosa',262)")

In [21]:
data=c.execute("SELECT * FROM food")
for i in data:
    print(i)

('Mango', 60)
('Samosa', 262)

In [22]:
## Its recommended to use this DROP command
c.execute("DROP table IF EXISTS food")

In [23]:
## Checking its deleted or not
c.execute("DROP table food")

OperationalError: no such table: food

In [24]:
db.commit()
db.close()